In [6]:
# Importation des modules utilisés
!pip install pandas
!pip install sqlite3


import sqlite3
import pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.12/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.12/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
ERROR: Could not find a version that satisfies the requirement sqlite3 (from versions: none)
ERROR: No matching distribution found for sqlite3

In [8]:
# Création de la connexion
conn = sqlite3.connect("ClassicModel.sqlite")

# Récupération du contenu de Customers avec une requête SQL
customer = pandas.read_sql_query("SELECT * FROM Customers;", conn)
print(customer)

     customerNumber                    customerName contactLastName  \
0               103               Atelier graphique         Schmitt
1               112              Signal Gift Stores            King
2               114      Australian Collectors, Co.        Ferguson
3               119               La Rochelle Gifts         Labrune
4               121              Baane Mini Imports      Bergulfsen
..              ...                             ...             ...
117             486    Motor Mint Distributors Inc.       Hernandez
118             487        Signal Collectibles Ltd.          Taylor
119             489  Double Decker Gift Stores, Ltd           Hardy
120             495            Diecast Collectables          Franco
121             496               Kelly's Gift Shop         Snowden

    contactFirstName           phone                  addressLine1  \
0             Carine      40.32.2555                54, rue Royale
1                Sue      7025551838               8489 Strong St.
2              Peter    03 9520 4555             636 St Kilda Road
3             Janine      40.67.8555  67, rue des Cinquante Otages
4              Jonas      07-98 9555        Erling Skakkes gate 78
..               ...             ...                           ...
117             Rosa      2155559857             11328 Douglas Av.
118              Sue      4155554312             2793 Furth Circle
119           Thomas  (171) 555-7555               120 Hanover Sq.
120          Valarie      6175552555                6251 Ingle Ln.
121             Tony   +64 9 5555500            Arenales 1938 3'A'

    addressLine2          city     state postalCode      country  \
0           NULL        Nantes      NULL      44000       France
1           NULL     Las Vegas        NV      83030          USA
2        Level 3     Melbourne  Victoria       3004    Australia
3           NULL        Nantes      NULL      44000       France
4           NULL       Stavern      NULL       4110       Norway
..           ...           ...       ...        ...          ...
117         NULL  Philadelphia        PA      71270          USA
118         NULL      Brisbane        CA      94217          USA
119         NULL        London      NULL    WA1 1DP           UK
120         NULL        Boston        MA      51003          USA
121         NULL      Auckland      NULL       None  New Zealand

    salesRepEmployeeNumber  creditLimit
0                     1370      21000.0
1                     1166      71800.0
2                     1611     117300.0
3                     1370     118200.0
4                     1504      81700.0
..                     ...          ...
117                   1323      72600.0
118                   1165      60300.0
119                   1501      43300.0
120                   1188      85100.0
121                   1612     110000.0

[122 rows x 13 columns]

In [17]:
orders = pandas.read_sql_query("SELECT * FROM Orders;", conn)
print(orders)

     orderNumber          orderDate       requiredDate        shippedDate  \
0          10100   2003/1/6 0:00:00  2003/1/13 0:00:00  2003/1/10 0:00:00
1          10101   2003/1/9 0:00:00  2003/1/18 0:00:00  2003/1/11 0:00:00
2          10102  2003/1/10 0:00:00  2003/1/18 0:00:00  2003/1/14 0:00:00
3          10103  2003/1/29 0:00:00   2003/2/7 0:00:00   2003/2/2 0:00:00
4          10104  2003/1/31 0:00:00   2003/2/9 0:00:00   2003/2/1 0:00:00
..           ...                ...                ...                ...
321        10421  2005/5/29 0:00:00   2005/6/6 0:00:00               NULL
322        10422  2005/5/30 0:00:00  2005/6/11 0:00:00               NULL
323        10423  2005/5/30 0:00:00   2005/6/5 0:00:00               NULL
324        10424  2005/5/31 0:00:00   2005/6/8 0:00:00               NULL
325        10425  2005/5/31 0:00:00   2005/6/7 0:00:00               NULL

         status                                           comments  \
0       Shipped                                               NULL
1       Shipped                             Check on availability.
2       Shipped                                               NULL
3       Shipped                                               NULL
4       Shipped                                               NULL
..          ...                                                ...
321  In Process  Custom shipping instructions were sent to ware...
322  In Process                                               NULL
323  In Process                                               NULL
324  In Process                                               NULL
325  In Process                                               NULL

     customerNumber
0               363
1               128
2               181
3               121
4               141
..              ...
321             124
322             157
323             314
324             141
325             119

[326 rows x 7 columns]

In [14]:
##Lister les clients n’ayant jamais effecuté une commande 
rq1 = pandas.read_sql_query(
    """
    SELECT c.customerNumber, c.customerName
    FROM Customers c 
    LEFT JOIN Orders o ON c.customerNumber = o.customerNumber 
    WHERE o.orderNumber is NULL;
    """,
    conn)

print(rq1)

    customerNumber                    customerName
0              125              Havel & Zbyszek Co
1              168          American Souvenirs Inc
2              169               Porto Imports Co.
3              206      Asian Shopping Network, Co
4              223                 Natürlich Autos
5              237                   ANG Resellers
6              247        Messner Shopping Network
7              273               Franken Gifts, Co
8              293               BG&E Collectables
9              303                Schuyler Imports
10             307                Der Hund Imports
11             335       Cramer Spezialitäten, Ltd
12             348           Asian Treasures, Inc.
13             356            SAR Distributors, Co
14             361                 Kommission Auto
15             369          Lisboa Souveniers, Inc
16             376           Precious Collectables
17             409  Stuttgart Collectable Exchange
18             443        Feuer Online Stores, Inc
19             459                Warburg Exchange
20             465             Anton Designs, Ltd.
21             477             Mit Vergnügen & Co.
22             480       Kremlin Collectables, Co.
23             481              Raanan Stores, Inc

In [16]:

##Pour chaque employé, le nombre de clients, le nombre de commandes et le montant total de celles-ci ;
rq2 =  pandas.read_sql_query(
    """
    SELECT 
    e.employeeNumber,
    e.firstName,
    e.lastName,
    COUNT(DISTINCT c.customerNumber) AS numberOfCustomers, 
    COUNT(DISTINCT o.orderNumber) AS numberOfOrders,
    SUM(p.amount) AS totalOrderAmount
    FROM Employees e
    LEFT JOIN Customers c ON e.employeeNumber = c.salesRepEmployeeNumber
    LEFT JOIN Orders o ON c.customerNumber = o.customerNumber
    LEFT JOIN Payments p ON o.customerNumber = p.customerNumber
    GROUP BY e.employeeNumber, e.firstName , e.lastName;
    """,
    conn)
    
print(rq2)

    employeeNumber firstName   lastName  numberOfCustomers  numberOfOrders  \
0             1002     Diane     Murphy                  0               0
1             1056      Mary  Patterson                  0               0
2             1076      Jeff   Firrelli                  0               0
3             1088   William  Patterson                  0               0
4             1102    Gerard     Bondur                  0               0
5             1143   Anthony        Bow                  0               0
6             1165    Leslie   Jennings                  6              34
7             1166    Leslie   Thompson                  6              14
8             1188     Julie   Firrelli                  6              14
9             1216     Steve  Patterson                  6              18
10            1286  Foon Yue      Tseng                  7              17
11            1323    George     Vanauf                  8              22
12            1337      Loui     Bondur                  6              20
13            1370    Gerard  Hernandez                  7              43
14            1401    Pamela   Castillo                 10              31
15            1501     Larry       Bott                  8              22
16            1504     Barry      Jones                  9              25
17            1611      Andy     Fixter                  5              19
18            1612     Peter      Marsh                  5              19
19            1619       Tom       King                  0               0
20            1621      Mami      Nishi                  5              16
21            1625   Yoshimi       Kato                  0               0
22            1702    Martin     Gerard                  6              12

    totalOrderAmount
0                NaN
1                NaN
2                NaN
3                NaN
4                NaN
5                NaN
6        12674066.13
7          943442.48
8         1035043.99
9         1545990.08
10        1635226.60
11        1870933.55
12        2093279.51
13       21850743.39
14        2580550.55
15        2188718.80
16        2357369.87
17        2352253.84
18        2119701.72
19               NaN
20        1815463.17
21               NaN
22        1014439.14

In [27]:
#Idem pour chaque bureau (nombre de clients, nombre de commandes et montant total), avec en plus le nombre de clients d’un pays différent, s’il y en a ;

rq3 =  pandas.read_sql_query(
    """
    SELECT 
        of.officeCode,
        of.city,
        of.country AS officeCountry,
        COUNT(DISTINCT c.customerNumber) AS numberOfCustomers, 
        COUNT(DISTINCT o.orderNumber) AS numberOfOrders,
        SUM(p.amount) AS totalOrderAmount,
        COUNT(DISTINCT CASE
              WHEN c.country != of.country THEN c.customerNumber
              ELSE NULL
        END) AS customersFromDifferentCountry
    FROM Offices of
        LEFT JOIN Employees e ON e.officeCode = of.officeCode
        LEFT JOIN Customers c ON e.employeeNumber = c.salesRepEmployeeNumber
        LEFT JOIN Orders o ON c.customerNumber = o.customerNumber
        LEFT JOIN Payments p ON o.customerNumber = p.customerNumber
        GROUP BY of.officeCode, of.city, of.country;
       
    """,
    conn)
print(rq3)

  officeCode           city officeCountry  numberOfCustomers  numberOfOrders  \
0        1.0  San Francisco           USA                 12              48
1        2.0         Boston           USA                 12              32
2        3.0            NYC           USA                 15              39
3        4.0          Paris        France                 29             106
4        5.0          Tokyo         Japan                  5              16
5        6.0         Sydney     Australia                 10              38
6        7.0         London            UK                 17              47

   totalOrderAmount  customersFromDifferentCountry
0       13617508.61                              0
1        2581034.07                              0
2        3506160.15                              3
3       27539012.59                             17
4        1815463.17                              3
5        4471955.56                              5
6        4546088.67                             12

In [18]:


#Pour chaque produit, donner le nombre de commandes, la quantité totale commandée, et le nombre de clients différents ;
rq4 =  pandas.read_sql_query(
    """
    SELECT 
        p.Productcode,
        p.ProductName,
        COUNT(od.OrderNumber) AS numbOfOrders,
        SUM(od.QuantityOrdered) AS TotalQuantity,
        COUNT(DISTINCT o.CustomerNumber) AS NumberofCustomer
    FROM Products p
        LEFT JOIN OrderDetails od ON p.ProductCode= od.ProductCode
        LEFT JOIN Orders o ON od.OrderNumber=o.OrderNumber
        GROUP BY p.ProductCode, p.Productname   
    """,
    conn)
print(rq4)

    productCode                            productName  numbOfOrders  \
0      S10_1678  1969 Harley Davidson Ultimate Chopper            28
1      S10_1949               1952 Alpine Renault 1300            28
2      S10_2016                  1996 Moto Guzzi 1100i            28
3      S10_4698   2003 Harley-Davidson Eagle Drag Bike            28
4      S10_4757                    1972 Alfa Romeo GTA            28
..          ...                                    ...           ...
105   S700_3505                            The Titanic            27
106   S700_3962                         The Queen Mary            27
107   S700_4002              American Airlines: MD-11S            28
108    S72_1253                       Boeing X-32A JSF            28
109    S72_3212                             Pont Yacht            27

     TotalQuantity  NumberofCustomer
0           1026.0                26
1            961.0                27
2            999.0                26
3            985.0                25
4           1000.0                27
..             ...               ...
105          952.0                22
106          883.0                24
107         1073.0                26
108          960.0                27
109          958.0                24

[110 rows x 5 columns]

In [28]:

rq5 =  pandas.read_sql_query(
    """
        SELECT 
            c.Country,
            COUNT ( DISTINCT o.OrderNumber) AS NumberofOrders,
            SUM(P.Amount) AS TotalPaidAmount, 
            SUM(od.PriceEach * od.QuantityOrdered) AS TotalPaid 
        FROM Customers c 
            LEFT JOIN Orders o ON c.CustomerNumber = o.CustomerNumber 
            LEFT JOIN OrderDetails od ON o.OrderNumber = od.OrderNumber 
            LEFT JOIN  Payments p  ON p.CustomerNumber = c.CustomerNumber
            GROUP BY c.Country;
    """,
    conn)
print(rq5)

         country  NumberofOrders  TotalPaidAmount    TotalPaid
0      Australia              19     2.482541e+07   2182269.38
1        Austria               7     4.090982e+06    606187.59
2        Belgium               7     1.931535e+06    283705.44
3         Canada               7     4.487022e+06    448157.12
4        Denmark               7     7.001114e+06    781357.50
5        Finland               9     1.009620e+07    988745.73
6         France              37     3.141444e+07   3160296.75
7        Germany               7     4.971661e+06    576293.44
8      Hong Kong               2     7.805498e+05     48784.36
9        Ireland               2     9.241029e+05    115512.86
10        Israel               0              NaN          NaN
11         Italy              10     1.324310e+07    945208.16
12         Japan               6     4.837611e+06    496898.36
13   Netherlands               0              NaN          NaN
14   New Zealand              15     1.710337e+07   1736137.04
15        Norway               9     8.870124e+06    848125.78
16   Philippines               3     2.444409e+06    282047.19
17        Poland               0              NaN          NaN
18      Portugal               0              NaN          NaN
19        Russia               0              NaN          NaN
20     Singapore               9     1.150336e+07   1038454.91
21  South Africa               0              NaN          NaN
22         Spain              36     2.123241e+08  12665636.19
23        Sweden               7     6.541197e+06    554287.75
24   Switzerland               2     3.649120e+06    235427.12
25            UK              13     1.506256e+07   1204373.23
26           USA             112     1.957451e+08  14228729.12

In [15]:
#On veut la table de contigence du nombre de commande entre la ligne de produits et le pays du client ;


rq6 =  pandas.read_sql_query(
    """
    SELECT 
    Products.productLine AS LigneProduit,
    Customers.country AS PaysClient,
    COUNT(DISTINCT Orders.orderNumber) AS NombreCommandes
FROM 
    Orders
JOIN 
    OrderDetails ON Orders.orderNumber = OrderDetails.orderNumber
JOIN 
    Products ON OrderDetails.productCode = Products.productCode
JOIN 
    Customers ON Orders.customerNumber = Customers.customerNumber
GROUP BY 
    Products.productLine, Customers.country
ORDER BY 
    Products.productLine, Customers.country;

    """,
    conn)
print(rq6)

     LigneProduit PaysClient  NombreCommandes
0    Classic Cars  Australia               12
1    Classic Cars    Austria                5
2    Classic Cars    Belgium                2
3    Classic Cars     Canada                6
4    Classic Cars    Denmark                5
..            ...        ...              ...
121  Vintage Cars  Singapore                4
122  Vintage Cars      Spain               22
123  Vintage Cars     Sweden                4
124  Vintage Cars         UK               10
125  Vintage Cars        USA               67

[126 rows x 3 columns]

In [17]:
#On veut la même table croisant la ligne de produits et le pays du client, mais avec le montant total payé dans chaque cellule ;

rq7=  pandas.read_sql_query(
    """
    SELECT 
    Products.productLine AS LigneProduit,
    Customers.country AS PaysClient,
    SUM(Payments.amount) AS MontantTotalPaye
FROM 
    Orders
JOIN 
    OrderDetails ON Orders.orderNumber = OrderDetails.orderNumber
JOIN 
    Products ON OrderDetails.productCode = Products.productCode
JOIN 
    Customers ON Orders.customerNumber = Customers.customerNumber
JOIN 
    Payments ON Orders.customerNumber = Payments.customerNumber
GROUP BY 
    Products.productLine, Customers.country
ORDER BY 
    Products.productLine, Customers.country;
 
    """,
    conn)
print(rq7)

     LigneProduit PaysClient  MontantTotalPaye
0    Classic Cars  Australia        7504795.97
1    Classic Cars    Austria        1884419.42
2    Classic Cars    Belgium         166880.87
3    Classic Cars     Canada         774924.01
4    Classic Cars    Denmark        3678313.22
..            ...        ...               ...
121  Vintage Cars  Singapore        1941227.28
122  Vintage Cars      Spain       39878490.66
123  Vintage Cars     Sweden        1377094.16
124  Vintage Cars         UK        4673162.78
125  Vintage Cars        USA       47090713.86

[126 rows x 3 columns]

In [35]:
#Donner les 10 produits pour lesquels la marge moyenne est la plus importante (cf buyPrice et priceEach) ;

rq8=  pandas.read_sql_query(
    """
   SELECT
       p.ProductCode,
       p.ProductName,
       AVG(od.PriceEach - p.BuyPrice) AS MargeMoyenne 
       FROM OrderDetails od JOIN Products p ON od.ProductCode = p.ProductCode
       GROUP BY p.ProductName 
       ORDER BY MargeMoyenne DESC 
       LIMIT 10; 
        
    """,
    conn)
print(rq8)

  productCode                           productName  MargeMoyenne
0    S10_1949              1952 Alpine Renault 1300     99.006429
1    S10_4698  2003 Harley-Davidson Eagle Drag Bike     95.235000
2    S18_3232           1992 Ferrari 360 Spider red     83.334906
3    S12_2823                      2002 Suzuki XREO     83.201429
4    S18_2795                1928 Mercedes-Benz SSK     82.696786
5    S12_1108                     2001 Ferrari Enzo     81.043704
6    S12_3891                      1969 Ford Falcon     77.335926
7    S18_3685        1948 Porsche Type 356 Roadster     72.636800
8    S18_2870          1999 Indy 500 Monte Carlo SS     71.794400
9    S18_1749              1917 Grand Touring Sedan     70.432800

In [9]:
rq9=  pandas.read_sql_query(
    """
SELECT 
    Products.productName AS NomProduit,
    Products.productCode AS CodeProduit,
    Customers.customerName AS NomClient,
    Customers.customerNumber AS CodeClient,
    OrderDetails.priceEach AS PrixVente,
    Products.buyPrice AS PrixAchat
FROM 
    OrderDetails
JOIN 
    Orders ON OrderDetails.orderNumber = Orders.orderNumber
JOIN 
    Customers ON Orders.customerNumber = Customers.customerNumber
JOIN 
    Products ON OrderDetails.productCode = Products.productCode
WHERE 
    OrderDetails.priceEach < Products.buyPrice;
    """,
    conn)

print(rq9)

                             NomProduit CodeProduit  \
0                1962 LanciaA Delta 16V    S10_4962
1                    1934 Ford V8 Coupe    S18_2957
2   18th Century Vintage Horse Carriage    S18_3136
3                    1969 Corvair Monza    S12_3148
4                1964 Mercedec Tour Bus    S18_2319
..                                  ...         ...
74               1962 LanciaA Delta 16V    S10_4962
75                       1958 Setra Bus    S12_1666
76          1913 Ford Model T Speedster    S18_2949
77       1998 Chrysler Plymouth Prowler    S18_2238
78                    2001 Ferrari Enzo    S12_1108

                       NomClient  CodeClient  PrixVente  PrixAchat
0   Online Diecast Creations Co.         363      61.99     103.42
1   Online Diecast Creations Co.         363      29.87      34.35
2   Online Diecast Creations Co.         363      47.04      60.74
3                Vitachrome Inc.         181      54.33      89.14
4                Vitachrome Inc.         181      37.48      74.86
..                           ...         ...        ...        ...
74       Anna's Decorations, Ltd         276      46.90     103.42
75       Anna's Decorations, Ltd         276      63.20      77.90
76       Anna's Decorations, Ltd         276      45.25      60.78
77    Down Under Souveniers, Inc         323      69.81     101.51
78               Lyon Souveniers         250      69.12      95.59

[79 rows x 6 columns]

In [10]:

rq10=  pandas.read_sql_query(
    """
SELECT 
    Customers.customerName AS NomClient,
    Customers.customerNumber AS CodeClient,
    SUM(Payments.amount) AS MontantTotalPaye,
    SUM(OrderDetails.priceEach * OrderDetails.quantityOrdered) AS MontantTotalAchats
FROM 
    Customers
JOIN 
    Payments ON Customers.customerNumber = Payments.customerNumber
JOIN 
    Orders ON Customers.customerNumber = Orders.customerNumber
JOIN 
    OrderDetails ON Orders.orderNumber = OrderDetails.orderNumber
GROUP BY 
    Customers.customerNumber, Customers.customerName
HAVING 
    SUM(Payments.amount) > SUM(OrderDetails.priceEach * OrderDetails.quantityOrdered);
    """,
    conn)
print(rq10)

                         NomClient  CodeClient  MontantTotalPaye  \
0                Atelier graphique         103         169259.72
1               Signal Gift Stores         112        2399781.32
2       Australian Collectors, Co.         114       10745060.15
3                La Rochelle Gifts         119        7226033.25
4               Baane Mini Imports         121        3731174.08
..                             ...         ...               ...
93    Motor Mint Distributors Inc.         486        1924689.68
94        Signal Collectibles Ltd.         487         753277.65
95  Double Decker Gift Stores, Ltd         489         432228.48
96            Diecast Collectables         495        1275476.04
97               Kelly's Gift Shop         496        7540854.72

    MontantTotalAchats
0             72539.88
1            248253.24
2            803981.64
3            540374.82
4            466396.76
..                 ...
93           251046.48
94           100437.02
95            72038.08
96           141719.56
97           633379.16

[98 rows x 4 columns]